{
  "helloMyNameIs": "Hello, my name is",
  "iAm": "I am",
  "frontendDeveloper": "Frontend Developer",
  "experenceDetails": "Software Development Engineer with 6 years of experience in Frontend, expert in React.js, Vue.js, Angular, JavaScript (ES6+), TypeScript, CSS3, HTML5, and other frontend tools. Specialized in responsive and scalable interfaces, applying reusable components and modern UI/UX practices, design systems, and automated testing to optimize performance and user experience, always seeking to learn and apply new technologies.",
  "exploreMyWork": "Explore my work",
  "headerHome": "Inicio",
  "headerAboutMe": "About me",
  "headerPortfolio": "Portfolio",
  "headerSkills": "Skills",
  "headerExperience": "Experience",
  "aboutMeTitle": "About me",
  "aboutMeDescription": "I am a Software Development Engineer specialized in Frontend, passionate about creating attractive, fast, and scalable interfaces. I love learning new technologies and, outside of work, I enjoy exercising, playing video games, and watching movies.",
  "aboutMeThroughouMyCareer": "Throughout my career, I have",
  "aboutMeLeadFrontend1": "Lead frontend developer",
  "aboutMeLeadFrontend2": "in more than 4 projects, taking responsibility from planning to implementation.",
  "aboutMeSupervisedJunior1": " Supervised and guided junior developers",
  "aboutMeSupervisedJunior2": "ensuring code quality and best practices.",
  "aboutMeTakeUXRole1": "I took on the role of",
  "aboutMeTakeUXRole2": "UX/UI",
  "aboutMeTakeUXRole3": "designer, creating intuitive and visually appealing interfaces.",
  "aboutMeDevelopLandingPage1": "Developed",
  "aboutMeDevelopLandingPage2": "multiple landing pages",
  "aboutMeDevelopLandingPage3": "optimizing the sites and adapting them to the different needs of the project.",
  "aboutMeCollaboredClients1": "Collaborated directly with clients",
  "aboutMeCollaboredClients2": "obtaining requirements, providing solutions, and supporting scalability",
  "aboutMeCollaboredClients3": "of the project",
  "aboutMeSupporteApplication1": "Provided",
  "aboutMeSupporteApplication2": "support in the implementation of applications",
  "aboutMeSupporteApplication3": "and",
  "aboutMeSupporteApplication4": "supervised the team code changes",
  "aboutMeSupporteApplication5": "before production launch.",
  "aboutMeIntereses": "Interests",
  "aboutMeIntereses1": " Be a full-stack developer",
  "aboutMeIntereses2": "Apply artificial intelligence in real-world projects",
  "portfolio": "Portfolio",
  "skills": "Skills",
  "experence": "Experence",
  "present": "Present",
  "experenceShedcloudShortDescription": "A portal to manage quotes, sales orders, and work orders, as well as create and edit inventory and manage product locations for import and export.",
  "experenceShedcloudTask1": "Implemented the frontend of a management platform with React.js, Next JS, TypeScript, Ant Design and TailwindCSS, achieving responsive and scalable interfaces.",
  "experenceShedcloudTask2": "Optimized performance with Redux and custom hooks, reducing load times on critical views.",
  "experenceShedcloudTask3": "Integrated REST APIs with Axios, ensuring efficient and secure communication with the backend.",
  "experenceShedcloudTask4": "Led CI/CD with GitHub Actions, Vercel and AWS, automating stable deployments to test and production.",
  "experenceShedcloudTask5": "Implemented unit tests with Jest and e2e using Cypress to ensure code quality, desired user experience, and proper component integration.",
  "experence3DportalShortDescription": "A website to configure shed buildings. Users can add and update walls, porches, roofs, building colors, and accessories, as well as create quotes, sales orders, and work orders. The system links each configuration with quotes, sales, and work orders, allowing users to continue editing at any stage.",
  "experence3DportalTask1": "Developed a 3D shed configurator with React.js, Three JS, Ant Design and TailwindCSS, enabling real-time customization.",
  "experence3DportalTask2": "Reduced 3D model load times by 50% by optimizing materials and update logic in React.",
  "experence3DportalTask3": "Improved performance by 25% by optimizing backend requests with Axios and caching strategies.",
  "experence3DportalTask4": "Applied Observer and Singleton patterns optimizing shared states and user experience.",
  "experenceFacturatuticketShortDescription": "A web platform to manage invoices for Realhost's companies. It allows any related company to access the website, add invoice details, and generate completed invoices.",
  "experenceFacturatuticketTask1": "Developed a web platform to automate quotes and production orders for print shops with Vue.js, CSS3 and Ant Design, being solely responsible for the project.",
  "experenceFacturatuticketTask2": "Designed and prototyped the UI/UX in Figma, achieving more intuitive interfaces.",
  "experenceFacturatuticketTask3": "Integrated REST APIs in Laravel with Axios, ensuring stable communication.",
  "experenceFacturatuticketTask4": "Defined code structure and metrics, applying best practices for scalability and maintenance.",
  "experenceFacturatuticketTask5": "Optimized production workflows by digitalizing product management such as magazines and books.",
  "experenceFacturatuticketDate": "January - November 2020"
}