{
    "helloMyNameIs": "Hola, mi nombre es",
    "iAm": "Soy un",
    "frontendDeveloper": "Desarrollador frontend",
    "experenceDetails": "Ingeniero en Desarrollo de Software con 6 años de experiencia en Frontend, experto en React.js, Vue.js, Angular, JavaScript (ES6+), TypeScript, CSS3, HTML5 y entre otras herramientas de uso frontend. Especializado en interfaces responsivas y escalables, aplicando componentes reutilizables y prácticas modernas de UI/UX, design systems y pruebas automatizadas para optimizar rendimiento y experiencia de usuario, siempre en búsqueda de aprender y aplicar nuevas tecnologías.",
    "exploreMyWork": "Conoce mi trabajo",
    "headerHome": "Inicio",
    "headerAboutMe": "Sobre mi",
    "headerPortfolio": "Portafolio",
    "headerSkills": "Habilidades",
    "headerExperience": "Experiencia",
    "aboutMeTitle": "Sobre mi",
    "aboutMeDescription": "Soy Ingeniero en Desarrollo de Software especializado en Frontend, apasionado por crear interfaces atractivas, rápidas y escalables. Me encanta aprender nuevas tecnologías y, fuera del trabajo, disfruto hacer ejercicio, jugar videojuegos y ver películas.",
    "aboutMeThroughouMyCareer": "Durante mi carrera, he realizado",
    "aboutMeLeadFrontend1": "Lider en desarrollo frontend",
    "aboutMeLeadFrontend2": "en más de 4 proyectos, asumiendo la responsabilidad desde la planificación hasta la implementación.",
    "aboutMeSupervisedJunior1": "Supervisé y guié a desarrolladores junior",
    "aboutMeSupervisedJunior2": "garantizando la calidad del código y las mejores prácticas.",
    "aboutMeTakeUXRole1": "Asumí el rol de diseñador",
    "aboutMeTakeUXRole2": "UX/UI",
    "aboutMeTakeUXRole3": "creando interfaces intuitivas y visualmente atractivas.",
    "aboutMeDevelopLandingPage1": "Desarrollé",
    "aboutMeDevelopLandingPage2": "multiples landing pages",
    "aboutMeDevelopLandingPage3": "optimizando los sitios y adaptandolo a las diferentes necesidades del proyecto.",
    "aboutMeCollaboredClients1": "Colaboré directamente con los clientes",
    "aboutMeCollaboredClients2": "obteniendo los requerimientos, dando soluciones y apoyando en la escalabilidad",
    "aboutMeCollaboredClients3": "del proyecto",
    "aboutMeSupporteApplication1": "Brindé",
    "aboutMeSupporteApplication2": "soporte en la implementación de aplicaciones",
    "aboutMeSupporteApplication3": "y",
    "aboutMeSupporteApplication4": "supervisé los cambios de código del equipo",
    "aboutMeSupporteApplication5": "antes del lanzamiento a producción.",
    "aboutMeIntereses": "Intereses",
    "aboutMeIntereses1": "Ser un desarrollador full-stack",
    "aboutMeIntereses2": "Aplicar inteligencia artificial en proyecto del mundo real",
    "portfolio": "Portafolio",
    "skills": "Habilidades",
    "experence": "Experiencia",
    "present": "Actual",
    "experenceShedcloudShortDescription": "Portal para gestionar cotizaciones, órdenes de venta y órdenes de trabajo, así como crear y editar inventario y administrar ubicaciones de productos para importación y exportación.",
    "experenceShedcloudTask1": "Implementé el frontend de una plataforma de gestión con React.js, Next JS, TypeScript, Ant Design y TailwindCSS, logrando interfaces responsivas y escalables.",
    "experenceShedcloudTask2": "Optimicé rendimiento con Redux y hooks personalizados, reduciendo tiempos de carga en vistas críticas.",
    "experenceShedcloudTask3": "Integré APIs REST con Axios, asegurando comunicación eficiente y segura con el backend.",
    "experenceShedcloudTask4": "Lideré CI/CD con GitHub Actions, Vercel y AWS, automatizando despliegues estables en test y producción.",
    "experenceShedcloudTask5": "Implementé pruebas unitarias con Jest y e2e mediante cypress  para asegurar calidad del código, experiencia del usuario deseada y que los componentes se integran correctamente.",
    "experence3DportalShortDescription": "Sitio web para configurar cobertizos. Los usuarios pueden agregar y actualizar paredes, porches, techos, colores de edificios y accesorios, así como crear cotizaciones, órdenes de venta y órdenes de trabajo. El sistema vincula cada configuración con cotizaciones, ventas y órdenes de trabajo, lo que permite a los usuarios continuar editando en cualquier etapa.",
    "experence3DportalTask1": "Desarrollé un configurador 3D de cobertizos con React.js, Three JS, Ant Design y TailwindCSS, permitiendo personalización en tiempo real.",
    "experence3DportalTask2": "Reduje en 50% tiempos de carga de modelos 3D optimizando materiales y lógica de actualización en React.",
    "experence3DportalTask3": "Mejoré rendimiento en 25% al optimizar peticiones al backend con Axios y estrategias de cacheo.",
    "experence3DportalTask4": "Apliqué patrones Observer y Singleton optimizando estados compartidos y experiencia de usuario.",
    "experenceFacturatuticketShortDescription": "Plataforma web para gestionar facturas de las empresas de Realhost. Permite que cualquier empresa relacionada acceda al sitio web, agregue detalles de facturación y genere facturas completas.",
    "experenceFacturatuticketTask1": "Desarrollé una plataforma web para automatizar cotizaciones y órdenes de producción en imprentas con Vue.js, CSS3 y Ant Design, siendo responsable único del proyecto.",
    "experenceFacturatuticketTask2": "Diseñé y prototipé la UI/UX en Figma, logrando interfaces más intuitivas.",
    "experenceFacturatuticketTask3": "Integré APIs REST en Laravel con Axios, asegurando comunicación estable.",
    "experenceFacturatuticketTask4": "Definí estructura y métricas de código, aplicando buenas prácticas para escalabilidad y mantenimiento.",
    "experenceFacturatuticketTask5": "Optimicé flujos de producción digitalizando la gestión de productos como revistas y libros."
}